{
  "name" : "Extended Project Qualification",
  "language" : {
    "java" : true,
    "c" : false,
    "web" : false
  },
  "topic" : {
    "nn" : false,
    "ai" : false,
    "simulation" : true,
    "graphics" : true,
    "os" : false
  },
  "date" : {
    "year" : 2016,
    "month": 4,
    "day": 1
  },
  "body" : [
      {
        "type" : "h2",
        "specialchar": {
          "front" : {
            "class": "fas fa-brain",
            "style": {
              "color": "orange"
            }
          },
          "back" : {
            "class": "fas fa-brain",
            "style": {
              "color": "blue"
            }
          }
        },
        "body" : "Website Project - Artificial Neural Network"
      },
      {
        "type": "quote",
        "quote": "One of the best presentations that I remember... Fantastic presentation, clear and coherent, very lively illustration of how the gradient descent works using a tablecloth and a small billiard ball, great team work",
        "author": {
          "type": "reference",
          "url": "https://www.doc.ic.ac.uk/~ae/",
          "body": {
            "type": "string",
            "body": "Abbas Edalat"
          }
        }
      },
      {
        "type": "h4",
        "body": "Project Outline"
      },
      {
        "type": "text",
        "body": "Over a 12-week period during the Second Term of University, we were tasked to Research and develop a website on a Computing Topic. As a team of four we were tasked with developing a website on <b>Feed-Forward Neural Networks and Backpropagation</b> which would include research into the theory, mathematics and history of this type of ANN. The website would be used to accompany a presentation that we would present to First Year Computing Students (our target audience) as well as several professors."
      },
      {
        "type" : "text",
        "body" : "I took the role of Team Lead for this Project which brought about a number of unique and varied challenges for me to overcome. "
      },
      {
        "type": "text",
        "body": "As a team we were rewarded with Prizes for “Second Best Presentation” and “Best Neural Network project” out of 37 groups, we achieved a mark of 54/55."
      },
      {
        "type" : "text",
        "body" : "As an afterthought, going to India with an idea and a plan although it was somewhat vague gave us a sense that this monumental task was possible."
      }
    ]
}